---
kind: method
id: M:Autodesk.Revit.DB.EdgeArray.Clear
source: html/1b9deb4d-aff3-1b12-8061-cc983d68040b.htm
---
# Autodesk.Revit.DB.EdgeArray.Clear Method

Removes every edge from the array, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```